Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དམ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་ཕྱག་རྒྱ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Then, noble son, the tathāgata arhat samyaksam­buddha Candrottama said to the bodhisattva mahāsattva Gaganamudra, ‘You must acquire, noble son, the dhāraṇī entranceway that is the form of omniscience.

source: །རིགས་ཀྱི་བུ་དེ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་ནི་འདས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་རྒྱལ་ཚབ་ཏུ་དབང་བསྐུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བཤད་པ་ཡིན་ལ།
en: All the past tathāgata arhat samyaksam­buddhas have taught it to the bodhisattvas they have consecrated to be their regents.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་རྒྱལ་ཚབ་ཏུ་དབང་བསྐུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སྟོན་པར་མཛད་ཅིང་།
en: Also, the present bhagavat buddhas who reside, live, and remain in the worlds in the ten directions teach it to the bodhisattvas whom they consecrate to be their regents.

source: གང་དག་མ་འོངས་པའི་དུས་ན་འབྱུང་བར་འགྱུར་བའི་སངས་རྒྱས་དེ་དག་ཀྱང་རྒྱལ་ཚབ་ཏུ་དབང་བསྐུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སྟོན་པར་འགྱུར་བས་ན་ཁྱོད་ཀྱིས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་ཟུང་ཤིག །ཏད་ཡ་ཐཱ། ཛྭ་ལི་ཛྭ་ལི་ནི། མ་ཧཱ་ཛྭ་ལི་ནི། ཧུག་ཀེ། བུག་ཀེ། སམ་པ་དེ། མ་ཧཱ་སམ་པ་དེ། དེ་བ་ན། ཨ་ཊི། བ་ཊི། ཊ་ཀེ། ཋ་ར་ཋ་ཀ་ཀེ། ཨ་མི་མ་ཀ་སི། ཧི་ལི་ཙི་ལི་ཏི་ལི། རུ་རུ་ཀེ། མ་ཧཱ་རུ་རུ་ཀེ། ཛ་ཡེ། དུརྫ་ཡེ། ཛ་ཡ་མ་ཏི། ཤཱན་ཏེ། ཤཱན་ཏ་ནིར་གྷོ་ཥ་ཎི། ཨ་མཱུ་ལེ། ཨ་མཱུ་ལ་པ་རི་ཚན་ནེ། མཱ་ར་སཻ་ནྱ། བི་ཏྲ་ས་ནེ། མུཀ་ཏེ། མུཀ་ཏ་པ་རི་ཤུད་དྷེ། ཨ་བྷཱི་ཏེ། བྷ་ཡ་མོ་ཙ་ནེ། བྷ་ར་ཨོ་ཧ་ར་ཎ། དཱན་ཏ། བི་དྱཱ་བི་དྱཱ། བི་དྱཱ་དྷ་རུ་ཏ་ཏ་མེ། ནི་ཨ་གྲ་ཧྃ་པ་ར་བཱ་དཱི་ནཱྃ། དྷརྨ་བཱ་དཱི་ནཱ་མ་ཨ་ནུ་གྲ་ཧན། ཨ་རཀྵ་དྷརྨ་བཱ་དཱི་ནཱྃ། ཙ་ཏུར་ཎཱྃ། སྨྲྀ་ཏྱུ་པ་སྠཱ་ནཱ་ནཱྃ། ཨ་དྷི་མུཀ་ཏི་པ་ད་པྲ་ཀཱ་ཤ་ན་པ་ད་མི་དན། བུད་དྷ་ཀཱ་ཤ་ཡེ། ཨ་མ་མ། མི་མ་མ། ཨ་བཻ་བི། ཨརྠེ། ཨརྠ་ནི། སྟཱི་ར་ཎེ། ལོ་ཀ་ཨ་དྷི་མུག་ཏེ། སུན་དྷ་རེ། པ་རི་བྷཱ་བ་ནེ། ཙ་ཏུར་ཎཱྃ།
en: Also, those who will be buddhas in the future will teach it to the bodhisattvas whom they consecrate to be their regents.

source: ཨཱརྱ་བྃ་ཤཱ་ནཱཾ། ཨ་དྷི་མུག་ཏི་པ་ད་པྲ་ཀཱ་ཤ་ན་པ་ད། བྷཱ་ཥ་ཨརྠེ་བྷཱ་ཥ་ཎེ། དྷ་རེ་དྷ་རེ་བ་ཏི། གུ་པ་ཏེ། ཤུ་བྷེ། ཤུ་བྷ་པྲ་བྷེ། ཏད་པཱ་ལ། ཨ་གྲ་ཕ་ལ། ཨ་ཕ་ལ་ནི། ཪྥལ། ནི་ཧ་ལ། སུ་མུཀ་ཏ། ཨ་མུཀ་ཏ། ནིར་མུཀ་ཏ། ཨ་བ་བྷྲ་མི་ཏ། བི་མུཀ་ཏ་བ་ཏི། བི་ལ་ཕ་ལ། ཨཱ་ཡུད་དྷ། ཨ་བི་ཏི། བི་བི་ཏི། ར་ཏི་ཀུ་ལ། ཏུ་ལ་མན། ཨ་ཧིང་ས་མ་ཨི་ཏི་ཏཱ་བ། ཨན་དྷཱ་ནན་དྷ་ད། སརྦ་ལོ་ཀ་ཨ་ན་ཀ་བི་ལིཀ་ཀ། ཨ་བྷུ་ས་རེ། ཧ་ཏ་མན་ཏེ། བེ་ཤ་ཨ་གྲ་མ་ཏེ། ཨ་ཕ་ལ། ཀ་ཕ་ལ། ཏྲ་ཡཱ་ཎཱྃ། ཨཱ་རཀྵི་ཏཱ་ནཱྃ། ཨ་དྷི་མུཀ་ཏི་པ་ད་མི་དན། ཛ་ཌ་ཏ། ཨ་ནི་ཧ་ར་བཱ་ཙ་ཏབ་བྱོ། ཨི་དམ་པཱ་ལན། ནི་ཡཱ་མ་ཕ་ལན། ས་མུ་དྲཱ་ན་ཡ། བི་བྷཱུ་ཥ་པ་ཤྱོ་སོ་མན་ཏ། ཨ་ནུ་མན་ཏོ། ཨ་ཀུ་མན་ཏོ། ཙྪེ་ད་བ་ནེ། མན་ཏྲ་སྟཱ། ད་ཤ་བ་ལ། བི་གྲ་ཧ་ཏ། ཨི་སུ་སྠཱ་ན། སུ་ནི་ཁ་མ། ཏཱིཀྵྞ་མ་ཏི། ཨཱ་ལོ་ཀ །ཨ་ཏི་ཏྲྀཥྞ། ཨ་ཏི་མི་ཏ། པྲ་ཏྱུད་པན་ན། བུད་དྷ་པཱུརྦ་པྲ་ཧ་རེ། ཙ་ཏུར་ཎཱི། སམ་མྱག་པྲ་ཧཱ་ཎཱ་ནཱྃ། ཨ་དྷི་མུཀ་ཏི་པ་ད་པྲ་ཀཱ་ཤ་ན་པད་མི་དན། ཨན་ནྱ་མན་ནྱེ་མ་ནེ། མ་མ་ནྱེ། བཱི་རི་བི་ཏི་རེ་ཤ་མེ། ཤ་མི་ཏེ་བི། ཤཱན་ཏེ། མུཀ་ཏེ། ནི་རུཀ་ཏ་མེ། ས་མེ། ས་མ་ས་མེ། ཀྵ་ཡེ། ཨཀྵ་ཡེ། ཨ་ཛི་ཏི་ཤཱན་ཏེ། ཤ་ནིཥྚེ། དྷཱར་ཎེ། ཨཱ་ལོ་ཀ །ཨ་བ་བྷཱ་སེ། རད་ན་བྲ་ཏེ། ར་སྨྱ་བ་ཏེ། ཛྙཱ་ན་བ་ཏེ། མེ་རུ་བ་ཏེ། ཀྵ་ཡ་ནི་དར་ཥ་ཎེ། ལོ་ཀ་པྲ་དཱི་པ་ནི་དར་ཥ་ཎེ།
en: Therefore, you too should acquire the dhāraṇī entranceway that is the form of omniscience.

source: ཙ་ཏུར་ཎཱིཔྲ་ཏི་སྃ་བི་དཱན། ཨ་དྷི་མུཀ་ཏི་པ་ད་པྲ་ཀཱ་ཤ་ན་པ་ད་མི་དན། ཙཀྵུ་ཨཱ་བྷཱ་ས་ནི་དར་ཥ་ཎེ། ཛྙཱ་ན་ཨཱ་ལོ་ཀ་ནིར་དར་ཥ་ཎེ། པྲ་བྷཱ་ས་ནེ། སརྦ་ཨིན་དྲཱི་ཡ། བྷཱུ་མི་ཨ་ཏི་ཀྲཱན་ཏེ། ས་བ་ས་བ། བཱ་མཱ་ན། སརྦེ་པྲ་ཐ་བཱ། ཀྵ་ཡང་ཀ་རེ། ཤོ་ཀ་ཨརྠ་བཱ་ཙ་ནེ། ལོ་ཀ་ཨ་ནུ་དར་ཥ་ཎ། བི་བྷཱུ་ཙ་ཏུར། རིད་དྷི་པཱ་དཱ། ཨ་དྷི་མུཀ་ཏི་པ་ད་པྲ་ཀ་ཤ་ན་པ་ད་མི་དན། ཨ་ཙ་ལེ་བུད་དྷེ། ད་དྷ་པྲ་ཙ་ལེ། ས་ཏྭེ་གྲྀ་ཧྞ། སིད་དྷི་ཀམ་པ་ནི་ནི་སྲིད་དྷ་སྨ་ཏི་ཏེ། པ་རི་ཀ་སེ་རེ། སཽ་མེ། ཙཎ་ཌེ། དཱན་ཏེ། ཨ་ཙ་ལེ། ཨ་མ་རེ། བི་ཙི་བ་ལེ། ནི་བ་རེ། པྲ་ཙ་ཙ་ལེ། པྲ་ས་རེ། ཨ་ན་ཡ། ཨ་བྱ་སེ། ཀརྐ་མེ། པྲ་བྷ་བི་ནི། ཨོ་མེ་ནི་ཛ་སེ། ཀྲ་གྲ་མེ། ན་ཡུ་ཏེ། ཨིན་དྲི་ཡཱ་ཎཱྃ། བ་ལཱ་ནཱྃ། ཨ་དྷི་མུཀ་ཏི་པ་དཔྲ་ཀཱ་ཤ་ན་པ་ད་མི་དན། པུཥྤེ་སུ་པུཥྤེ། དྲུ་མ་པ་རི་ཧ་རེ། ཨ་བྷ་ཡ་རུ་ཙི་རེ། ཙི་ཀ་རཀྵེ། ཨཀྵ་ཡམ་སྟུ་ནི་ནི་ལེ། མ་མ་ལེ། པཉྩ་ཤི་ཤི་
en: It is thus: jalijalini mahājalini phutke butke sammade mahāsammade devāṃ aṭi caṭi ṭake ṭharaṭhakke amimakasi hilicilitili ruruke mahāruruke jaye durjaye jayamati śānte śāntanirghoṣaṇi amūle ale amūlaparichinne mārasainya vitrāsane mukte mukta­pari­śuddhe abhīte bhayamocane bhāradroharaṇā dānta vidyāvidyā varuttame nigrahaṃ paravādināṃ dharma­vādināmanu­grahaṃ ārakṣā dharma­vādināṃ caturṇāṃ smṛtyupa­sthānānām adhimukti­pada­prakāśanapadam­idaṃ | buddha­kāśaye amama nimama avevi arthe arthani stīraṇe lokādhimukte sandadha paribhāvane caturṇāmāryavaṃśānāṃ adhimukti­pada­prakāśanapadā | bhāṣīthe bhāṣaṇe dhāre dhārayati gupte śubhe śubhaprade tatphale agraphale ’niṣphale nilaha samukta amukta nirmukte atravita vimuktavati vilaphala ayukta iviti diviti ratitula tulamaṃ ahiṃsāma ititāva atvānatvāna sarvaloka anaka livindha abhūsare hatamatte veśāgravate aphala kaphala trayāṇām ārakṣitānāṃ adhimuktipadamidaṃ | jaḍataḥ ani­haravavatavyo idaṃ phalaṃ niyoma­phalaṃ samudānāya vibhuṣa paśya sāmantra anumanto akumanto chedāvane mantrastā daśabala vigrahasthā isusthita sunikhama tīkṣṇamati āloko atitṛṣṇā adimati pratyutpanna­buddha­pūrva­prahāre caturṇāṃ samyakprahāṇānāṃ adhi­mukti­pada­prakāśanapadam­idaṃ | anye manye mane mamane vire virate śame śamitā viśānte mukte nirakṣame same samasame kṣaye akṣaye ajiti śānte samiṣṭhe dhāraṇī ālokāvabhāse ratna­vrate raśmyavate jñāna­vate meruvate kṣayanidarśane loka­pradīpani­darśane caturṇāṃ prati­saṃvidāmadhi­mukti­pada­prakāśanapadam­idaṃ | cakṣa ābhāsanidarśane jñānā­lokanidarśanaṃ ca prabhāsane sarvendriya bhūmātikrante sarvasarve vamāṃ sarve prāthavā kṣayaṃ kare gokāha vadane lokānudarśana vibhū caturṇāṃ ṛddhipādānām adhi­mukti­pada­prakāśanapadam­idam | acale buddhe dṛdhapracale sattve gṛhna siddhi kaṃpati nisiddha smahiddhe parekasire some caṇḍe datve acale acale apare vicivale nipare pracacale prasare anayan prabhyāse kaṃkame prabhāvini same nijase grakrame nayute indriyāṇāṃ balānām adhi­mukti­pada­prakāśanapadam­idaṃ | puṣpe supuṣpe druma­pari­hāre abhayarucire cekaratke akṣayamastu ninile mamale pañcaśiśire lokasya vijñāne naya­saṃgṛhīte ca yukte succendena saptānāṃ bodhyaṅgānāṃ adhi­mukti­pada­prakāśanapadam­idaṃ | cakravajre maitra samāpade krānte kete karuṇa rudīkṣayi prītirūpe kṣamasaṃpanne arake varate kharo khare amūle mūle sādhane caturṇāṃ vaiśāradyānām adhi­mukti­pada­prakāśanapadam­idaṃ | vartte cakre cakradhare varacakre vare prare hile hile dhare ārūpāvate huhure yathā jibhaṃga niṃbare yathāgne yathāparaṃ cariniśe yathā bhayaririśi satyanirhāra jaracavila vīryanirhāra cure mārganirhāra samādhinirhāra prajñānirhāra vimuktinirhāra vimuktijñānadarśananirhāra nakṣatranirhāra candra­nirhāra sūrya­nirhāra padāśca­turuttara­tathāgatena adbhutaṃ niradbhutaṃ saṃbuddhaṃ abuddha ihabuddhaṃ tatra­buddhaṃ nihaṃgamapare alaha dalaha paṇḍare paṇḍare tatrāntalu māṃgagharaṇi pūṭani saṃpūṭani gata­praṃgamanuniruva nāśani nāśabandhani cicchini cicchidra mayova hidiṃgamā vare mare hanane bharaṃ bhare bhinde bhire bhire ruṣare śaraṇe darane pravartte varaṇāḍaye vidranvumā varakhumā brahma­cāriṇa indravani dhidhirāyani maheśvaralalani mamasume alamini ekākṣaraci vaṃcani carasti ābhicaṇḍāla sūre sarvasurā āvarasurā punakanitāṃ paṇḍitāṃ āyinakaṇḍi jabhāme gandhare atra runimakare bhirohiṇī siddhamatte vilokamate buddhādhiṣṭhite dhāraṇīmukhe daśānāṃ balānām adhi­mukti­prakāśanapadam­idaṃ | As soon as the Bhagavat recited the dhāraṇī entranceway that is the form of omniscience, that great billion-world universe shook intensely in six ways: it shook, shook strongly, and shook intensely; it shuddered, shuddered intensely, and shuddered fiercely; it quivered, quivered intensely, and quivered fiercely; it trembled, trembled intensely, and trembled fiercely; it quaked, quaked intensely, and quaked fiercely; it bent upward, bent downward, and bent deeply downward.

source: རེ། ལོ་ཀ་སྱ་བི་ཛྙཱ་ནེ། ན་ཡ་སམ་གྲྀ་ཧི་ཏེ་ཙ་ཡུཀ་ཏེ། ཙྪན་དེ་ན། སཔ་ཏཱ་ནྃ། བོ་དྷྱེ་གཱ་ནཱྃ། ཨ་དྷི་མུཀ་ཏི་པ་ད་པྲ་ཀ་ཤ་ན་པ་ད་མི་དན། ཙཀྲ་བཛྲེ། མཻ་ཏྲེས་མ་མ་ཏི་ཀྲཱན་ཏེ། ཀྲེ་ཏེ། ཀཱ་རུ་ཎེ། རུ་དིཀྵ་ཡི། པྲི་ཏིརཱུ་པེ་ཀྵ་སྃ་པན་ནེ། ཨ་ར་ཏེ། བ་ར་ཏེ། ཁ་གེ་ཁ་གེ །ཨ་མཱུ་ལེ། མཱུ་ལ་ཤོ་དྷ་ནེ། ཙ་ཏུར་ཎཱྃ་བཻ་ཤ་ར་དྱཱ་ནཱྃ། ཨ་དྷི་མུཀ་ཏི་པ་ད་པྲ་ཀཱ་ཤ་ན་པ་ད་མི་དན། བར་ཏེ་ཙཀྲེ། ཙཀྲཱ་དྷ་རེ། པ་ར་ཙཀྲེ། པ་རེ་པུ་རེ། ཧི་ལེ་ཧི་ལེ། དྷ་རེ་ཨ་རཱུ་བ་ཏེ། ཧུ་ཧུ་རེ། ཡ་ཐཱ་ཛི་བྷྃ་གན། ནི་མ་བ་རེ། ཡ་ཐཱ་ཨག་ནེ། ཡ་ཐཱ་བ་རན་ཙི་རི་ཏི་རི་ཤ་ཡ་ཐཱ། བྷ་ཡ་རི་རི་ཤི། ས་ཏྱ་ནིར་ཧ་རེ། ཛ་ར་བ་བི་ལ། བཱིརྱ་ནིར་ཧ་ར། ཙུ་རེ་མཱརྒ་ནིར་ཧཱ་ར། ས་མཱ་དྷི་ནིར་ཧཱ་ར། པྲཛྙཱ་ནིར་ཧཱ་ར། བི་མུཀ་ཏི་ནིར་ཧཱ་ར། བི་མུཀ་ཏི། བི་མུཀ་ཏི། ཛྙཱ་ན་དར་ཥ་ཎ་ནིར་ཧཱ་ར། ནཀྵ་ཏྲ་ནིར་ཧཱ་ར། ཙན་དྲ་ནིར་ཧཱ་ར། སཱུརྱ་ནིར་ཧཱ་ར། པ་དཱ་ཤྩ་ཏུ་རུཀ་ཏསྟ་ཐཱ་ག་ཏེ་ན། ཨད་བྷཱུ་ཏ། ནི་རད་བྷཱུ་ཏཱཾ། སྃ་བུད་དྷམ། ཨ་བུད་དྷམ། ཨི་ཧ་བུད་དྷམ། ཏ་ཏྲ་བུད་དྷམ། བི་ཧྃ་གམ་པུ་རེ། ཨ་ཕ་ལ། ད་ཕ་ལ། པཎ་ཌ་རེ། པཎ་ཌ་རེ། ཏ་དྲ་ལན། ཏ་ལུ། མྃ་ག་ལ་དྷ་རི་ཎི། པཱུ་ཌ་ནི། སྃ་པྲ་པཱུ་ཌ་ནི། ག་ཏ་པྲ་ག་མ་ཏ་ནི་རཱུ་པ། ནཱ་ཤ་ནི། ན་ཤ་བན་དྷ་ནི། ཙིད་ཙི་ནི། ཙིད་ཙི་ནི། ས་ཡོ་དྷ། ཧི་དིང་ག་མ། པ་རེ་པ་ར། ཧ་ན་ནེ། བྷ་རམ་བྷ་རེ། བྷིན་དེ། བི་རེ་བི་རེ། རུ་ཥ་རེ། ཤ་ར་ཎེ། ད་ར་ཎེ། པྲ་བར་ཏེ། བ་ར་རྴ་ཌ་ཡེ། བི་དུན་དུ་མཱ། བར་ཁུ་མཱ། པྲ་ཧྨ་ཙ་རི་ཎི། ཨིན་དྲ་བ་ནི། དྷི་དྷི་རཱ་ཡ་ནི། མ་ཧེ་ཤྭ་ར་ལ་ལ་ནི། མ་མ་སུ་མེ། ཨ་ལ་མི་ནི། ཨེ་ཀ་ཨཀྵ་ར་ནི། པཉྩ་ནི་ཙ་ར་སྟི། ཨ་བྷི་ཙཎ་ཌ་ལ་པུ་རེ། སརྦ་སུ་རེ། ཨ་བར་སུ་རེ། པཱུརྞྞ་ག་ཏི་ཏན། པཎ་ཌི་ཏན། ཨ་ཡི་ན་ཀཎ་ཌ། ཛམ་བྷ་མེ། གན་དྷ་རེ་ཨ་ཏྲ། ན་ཧ་ནི་མ་ཀ་ར་བྷི་རོ་ཧི་ནི། སིད་དྷ་མན་ཏྲེ། བི་ལོ་ཀ་མ་ཏྲེ། བུད་དྷ་ཨ་དྷིཥྠི་ཏེ། དྷཱ་ར་ཎི་མུ་ཁི། ད་ཤཱ་ནཱ་མ་བ་ལཱ་ནཱྃ་ཨ་དྷི་མུཀ་ཏི་པྲ་ཀཱ་ཤ་ན་པ་ད་མི་དན། བཅོམ་ལྡན་འདས་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་གསུངས་མ་ཐག་ཏུ། དེ་ནས་དེའི་མོད་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་ཏེ། གཡོས། རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས་སོ། །འགུལ། རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ་ཏོ། །འཁྲུགས། རབ་ཏུ་འཁྲུགས། ཀུན་ཏུ་རབ་ཏུ་འཁྲུགས་སོ། །ཆེམ་ཆེམ། རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ་མོ། །མཐོ་བ་དང་རབ་ཏུ་དམའ་བ་དང་། ཀུན་ཏུ་རབ་ཏུ་དམའ་བར་ཡང་གྱུར་ཏོ། །གང་གི་ཕྱིར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་བགྲང་བ་ལས་ཡང་དག་པ་འདས་པའི་བྱེ་མ་སྙེད་དག་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་པ་དེ་ལྟ་བུའི་སྣང་བ་དག་ཀྱང་བྱུང་བར་གྱུར་ཏོ།
en: And a light appeared so that the worlds in the ten directions, which are as numerous as the grains of sand in countless Ganges Rivers, were filled with vast light.

source: །དེའི་ཚེ་ན་རི་རབ་དང་། ཁོར་ཡུག་དང་། ཁོར་ཡུག་ཆེན་པོ་དག་ཀྱང་མིག་ལམ་ན་མི་སྣང་ངོ་།
en: At that time, the Sumeru, Cakravāḍa, and Mahācakravāḍa mountains were not to be seen.

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་ཀྱང་ལག་མཐིལ་ལྟར་མཉམ་པར་ཀུན་ཏུ་སྣང་ངོ་།
en: The countless worlds in the ten directions appeared to be as flat as the palm of one’s hand.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་ན་གནས་པ་དེ་དག་དང་། གང་དག་ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་བཟོད་པ་ཐོབ་པ་དེ་དག་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་ཉན་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་མཐུས་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ནས་མི་སྣང་བར་གྱུར་ཏེ། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས།
en: Also, through the power of the Tathāgata, the bodhisattva mahāsattvas who resided in countless worlds in the ten directions, who had attained samādhi, dhāraṇī, and acceptance, vanished from their own realms and arrived in the presence of the Bhagavat on Vulture Peak Mountain.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་ཐ་དད་པ་སྣ་ཚོགས་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་དེ་ཉིད་དུ་འཁོད་དོ། །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་།
en: They bowed their heads to the Bhagavat’s feet and, through various manifold bodhisattva miracles, made offerings to the Bhagavat. They then seated themselves there in order to hear this dhāraṇī entranceway that is the form of omniscience.

source: ལྷ་མ་ཡིན་དང་། གྲུལ་བུམ་དང་། ཤ་ཟ་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་མཉན་པའི་ཕྱིར་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Also, countless devas, nāgas, yakṣas, asuras, kumbhāṇḍas, and piśācas came to Vulture Peak Mountain to the presence of the Bhagavat, bowed their heads to the Bhagavat’s feet, and sat to one side in order to hear this dhāraṇī entranceway that is the form of omniscience.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་འདིར་འདུས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་པད་མ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་ཡང་མཐོང་བར་གྱུར་ཏོ།
en: All the bodhisattva mahāsattvas who were gathered there saw the Padmā buddha realm and the tathāgata arhat samyaksam­buddha Padmottara encircled by an assembly of bodhisattvas.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་གསུངས་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གཱའི་ཀླུང་བདུན་ཅུ་རྩ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་ཀྱིས་གཟུངས་འདི་ཐོབ་བོ།
en: As soon as the Bhagavat had recited this dhāraṇī entranceway that is the form of omniscience, bodhisattva mahāsattvas as numerous as the grains of sand in seventy-two Ganges Rivers obtained this dhāraṇī.

source: །གཟུངས་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དེ་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་མཐོང་བར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏེ་དེ་དག་ངོ་མཚར་དུ་འཛིན་པར་གྱུར་ནས་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་།
en: The bodhisattvas who had obtained the dhāraṇī saw the bhagavat buddhas who dwelt in countless worlds in the ten directions and saw the array of the qualities of those buddha realms.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པས་སངས་རྒྱས་ལ་མཆོད་པ་བྱས་ཏེ་དེ་ཉིད་དུ་འཁོད་པ་དང་།
en: They were amazed, and, through the power of samādhi and bodhisattva miracles, made offerings to the Buddha and then were seated.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་བསྒོམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གཟུངས་ཀྱི་སྒོ་བརྒྱད་ཁྲི་བཞི་སྟོང་འཐོབ་བོ། །གཟུངས་ཀྱི་སྒོ་བདུན་ཁྲི་ཉིས་སྟོང་ཡང་འཐོབ་བོ། །ཏིང་ངེ་འཛིན་གྱི་སྒོ་དྲུག་ཁྲི་ཡང་འཐོབ་བོ།
en: The Bhagavat said to them, “Noble sons, the bodhisattva mahāsattvas who meditate upon the dhāraṇī entranceway that is the form of omniscience will attain 84,000 dhāraṇī entranceways; they will attain 72,000 further dhāraṇī entranceways; and they will attain 60,000 samādhi entranceways. “

source: །གཟུངས་ཀྱི་སྒོ་འདི་འཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བྱམས་པ་ཆེན་པོ་ཡང་འཐོབ་བོ། །སྙིང་རྗེ་ཆེན་པོ་ཡང་འཐོབ་སྟེ།
en: The bodhisattva mahāsattvas who have attained this dhāraṇī entranceway will attain great kindness and great compassion.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཏིང་ངེ་འཛིན་འདི་འབའ་ཞིག་ཐོབ་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་རྟོག་པར་བྱེད་ཅིང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱང་འཐོབ་སྟེ།
en: Bodhisattva mahāsattvas contemplate the thirty-seven factors of enlightenment and attain omniscience solely in order to obtain this samādhi.

source: འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པ་ཡིན་ནོ།
en: It contains the entirety of all the Buddha’s teachings.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཀྱང་གཟུངས་འདིའི་ངོ་བོ་ཉིད་ཐུགས་སུ་ཆུད་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པར་མཛད་ཅིང་ཤིན་ཏུ་མྱུར་བར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ཡང་མི་མཛད་དོ།
en: All the bhagavat buddhas, through having understood this dhāraṇī in its essence, teach the Dharma to beings and do not pass into parinirvāṇa too soon. “

source: །རིགས་ཀྱི་བུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདིའི་གཟུངས་ཀྱི་མཐུས་ས་ཆེན་པོ་འདི་རབ་ཏུ་གཡོས་ཤིང་སྣང་བ་བྱུང་བར་གྱུར་པ་དང་། སྣང་བ་དེས་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་མུ་མེད་པ་དག་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་པ་དང་། སྣང་བ་དེས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་མུ་མེད་པ་འདི་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་མཉན་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་མུ་མེད་པ་དག་ནས་ཀུན་ནས་འདིར་ལྷགས་པ་ལ་ལྟོས།། །།བམ་པོ་གཉིས་པ། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་ན་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷ་དང་།
en: Noble sons, see how the power of this dhāraṇī, the dhāraṇī entranceway that is the form of omniscience, caused the great earth to shake and a great light to shine, a light that spread a vast radiance throughout endless, infinite buddha realms, and how that light caused endless, infinite bodhisattvas to come from endless, infinite buddha realms in order to hear the dhāraṇī entranceway that is the form of omniscience. “

source: ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། མི་དང་། མི་མ་ཡིན་པ་མཐའ་ཡས་པ་མུ་མེད་པ་གང་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་ཉན་པར་བྱེད་པ་དེ་དག་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་ཐོབ་མ་ཐག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་གོ།
en: The endless, infinite devas of the desire realm and form realm, and the nāgas, yakṣas, asuras, humans, and nonhumans within this Sahā universe who listen to the dhāraṇī entranceway that is the form of omniscience, as soon as they have obtained the dhāraṇī entranceway that is the form of omniscience, will be irreversible in their progress to complete enlightenment. “

source: །ཡི་གེར་འདྲི་བར་བྱེད་ན་ཡང་སངས་རྒྱས་ལ་ལྟ་བ་དང་། ཆོས་ཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་།
en: Those who write it out will always see the Buddha, listen to the Dharma, and serve the Saṅgha until complete parinirvāṇa.

source: བླ་ན་མེད་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དང་མི་འབྲལ་ལོ། །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་ཁ་ཏོན་དུ་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ལས་དང་པོ་རྣམས་མ་ལུས་པར་ཟད་པར་བྱེད་ཅིང་ཚེ་རྗེས་ནས་ཀྱང་ས་དང་པོ་གནོན་པར་བྱེད་དོ།
en: The bodhisattvas who chant the dhāraṇī entranceway that is the form of omniscience will eliminate without remainder their primary karma, and in the next life they will ascend to the first bhūmi. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་སྒོམ་པར་བྱེད་ན། གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་མཚམས་མེད་པ་ལྔའི་ལས་བྱས་ཤིང་བསགས་པ་ཞིག་ཡོད་ན་ཡང་དེའི་ལས་དེ་དག་ཡོངས་སུ་ཟད་ཅིང་གང་གི་ཕྱིར་ཚེ་རྗེས་ན་ཡང་ས་དང་པོ་གནོན་པར་བྱེད་དོ།
en: The bodhisattva mahāsattvas who meditate on the dhāraṇī entranceway that is the form of omniscience will completely eliminate even the five actions with immediate results at death if they have committed and accumulated them, and in the next life they will ascend to the first bhūmi.

source: །གང་ལ་མཚམས་མེད་པའི་ལས་རྣམས་མེད་པ་དེ་ནི་ཚེ་འདི་ཉིད་ལ་ལས་གཞན་ཐམས་ཅད་མ་ལུས་པར་ཟད་ཅིང་ཚེ་རྗེས་ནས་ཀྱང་ས་དང་པོ་གནོན་པར་བྱེད་དོ།
en: If they have not committed the actions with immediate results at death, then in that lifetime they will completely eliminate all other karma and in the next life will ascend to the first bhūmi. “

source: །གང་སྒོམ་པར་མི་བྱེད། ཁ་ཏོན་དུ་མི་བྱེད་ཀྱང་ཉན་ཅིང་ཆོས་སྨྲ་བ་ལ་དར་གྱིས་འཆིང་བར་བྱེད་ན་དེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་རྣམས་ཀྱིས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བ་སྦྱིན་པར་འགྱུར་ཞིང་།
en: Even if someone does not meditate on this dhāraṇī or chant this dhāraṇī, but only listens to it and binds a turban onto the Dharma reciter, then the bhagavat buddhas residing, living, and remaining in other realms, who are as numerous as the grains of sand in the Ganges River, will declare ‘excellent!’

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་ཏེ།
en: and those bhagavat buddhas will prophesy his attainment of the highest, most complete enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་དེར་ཡོངས་སུ་བཏང་བས་རིང་པོར་མི་ཐོགས་པར་རྒྱལ་ཚབ་ཏུ་དབང་བསྐུར་ཞིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་འགྱུར་རོ།
en: Not long after, that bodhisattva will be consecrated as their regent, and he will be only one lifetime away from attaining the highest, most complete enlightenment.

source: །དེ་བཞིན་དུ་གང་ལ་ལ་ཆོས་སྨྲ་བ་ལ་སྤོས་ཀྱིས་མཆོད་པ་བྱེད་ན་དེ་ཡང་རིང་པོར་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྤོས་འཐོབ་བོ།
en: In the same way, those who make an offering of incense to the Dharma reciter will before long obtain the incense of the highest, most complete enlightenment.

source: །ཆོས་སྨྲ་བ་ལ་མེ་ཏོག་གིས་མཆོད་པ་བྱེད་ན་བླ་ན་མེད་པ་ཡེ་ཤེས་ཀྱི་མེ་ཏོག་དག་འཐོབ་བོ།
en: If they offer a flower to the Dharma reciter, they will obtain the unsurpassable flowers of wisdom.

source: །ཆོས་སྨྲ་བ་ལ་འབྲས་ཆན་དང་། བཟའ་བ་དང་། བཏུང་བ་དག་བྱིན་ན་དེ་བཞིན་གཤེགས་པའི་ཟས་བླ་ན་མེད་པ་འཐོབ་པར་འགྱུར་རོ།
en: If they offer cooked rice, food, and drink to the Dharma reciter, they will attain the unsurpassable nourishment of the tathāgatas.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་སྨྲ་བ་ལ་གོས་ཀྱིས་བཀབ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་མདོག་བླ་ན་མེད་པ་འཐོབ་བོ།
en: If the bodhisattvas clothe the Dharma reciter, they will attain the unsurpassable complexion of a tathāgata.

source: །གང་ཞིག་ཆོས་སྨྲ་བ་ལ་རིན་པོ་ཆེ་དག་གིས་འགེབས་པར་བྱེད་ན་དེ་ཡང་རིང་པོར་མི་ཐོགས་པར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་སུམ་ཅུ་རྩ་བདུན་གྱི་ཆོས་རིན་པོ་ཆེ་རྣམས་འཐོབ་སྟེ།
en: If they adorn the Dharma reciter with jewels, they will obtain before long the jewels of the Dharma of the thirty-seven factors of enlightenment. “

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་དེ་ནི་དེ་ལྟར་དོན་ཆེ་བ་ཡིན་ནོ།
en: Noble sons, the dhāraṇī entranceway that is the form of omniscience has this kind of great benefit for bodhisattva mahāsattvas.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཐམས་ཅད་དེར་བསྟན་པས་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐོགས་པ་མེད་པའི་སྤོབས་པ་འཐོབ་ཅིང་ཡིད་དུ་འོང་བའི་ཆོས་བཞི་ཡང་འཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: It is because the entire bodhisattva piṭaka is taught in it. Bodhisattva mahāsattvas gain unimpeded eloquence through this dhāraṇī entranceway that is the form of omniscience and attain the four attractive qualities. “

source: །རིགས་ཀྱི་བུ་གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དམ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་ཕྱག་རྒྱ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་དེ་དག་གིས་གཏམས་པ་དེ་ཉིད་ཀྱི་ཚེ་ཡང་དེ་བཞིན་དུ་ས་གཡོས་པར་གྱུར་ཅིང་། འཇིག་རྟེན་དུ་སྣང་བ་ཆེན་པོ་ཡང་བྱུང་བར་གྱུར་ཏེ།
en: Noble sons, when the tathāgata arhat samyaksam­buddha Candrottama taught the dhāraṇī entranceway that is the form of omniscience to the bodhisattva mahāsattva Gaganamudra, the earth shook, and a great light shone in the world.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་ཀྱང་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །དེ་བཞིན་དུ་ས་ཕྱོགས་མི་མཉམ་པ་དག་ཀྱང་ལག་མཐིལ་ལྟར་མཉམ་པར་སྣང་ངོ་།
en: That great light illuminated countless buddha realms in the ten directions, and all uneven land appeared to be as flat as the palm of the hand.

source: །དེར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་འདུས་པ་དེ་དག་གིས་ཀྱང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཐོང་བར་གྱུར་ཏོ།
en: All the bodhisattva mahāsattvas gathered there saw the bhagavat buddhas who were in countless buddha realms in the ten directions. “

source: །དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་ནས་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དམ་པ་ལ་ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་ཉིད་ཀྱང་མཉན་པའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་ཙན་དན་དུ་ལྷགས་སོ།
en: Countless bodhisattva mahāsattvas came from countless buddha realms in the ten directions to the Candanā realm to honor and pay homage to the tathāgata arhat samyaksam­buddha Candrottama and to hear this dhāraṇī entranceway that is the form of omniscience. “
